Tekla Open API Reference for Tekla Structures 2025
LoadTemperature.Weight Property
Note: This API is now obsolete.
 Property not supported in LoadTemperature class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Property not supported in LoadTemperature class.",
	true)]
public double Weight { get; set; }
<ObsoleteAttribute("Property not supported in LoadTemperature class.",
	true)>
Public Property Weight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
LoadTemperature Class
Tekla.Structures.Model Namespace